from modules.dialog_module import print_dialog
def main():
    print_dialog("""
Добро пожаловать в увликательное преключение!
    
[yellow]Разрабатывал:[/yellow] Антон Кохнюк
    
Чтобы скипать диалоги нажмите
:backhand_index_pointing_right:[red]  Enter [/red]:backhand_index_pointing_left:
    """)
    print_dialog("""
Однажды на одной планете обитали люди и нечисть.
Они жили в постоянных конфликтах.
И в один момент с небес сошёл полубог.
        """)
    print_dialog("""
Он сошёл к ним не с благими намериями.
Начался хаос, зеля трещала и трескалась на куски.
Полу бог разбил землю на множество кусков и
бросил всех кто населял землю
медненно умирать
        """)
    print_dialog("""
Когда вы очнулись вы ничего не помнили.
Вы знаете только свои увлечения и способности.

[yellow][Сейчас будет выбор способностей][/yellow]
    """)



if __name__ == "__main__":
    main()